#include <iostream>

/*
    Разработать программу синтеза и обхода бинарного дерева. 

    Для заданной последовательности данных с помощью созданной программы построить и сохранить в файле бинарное дерево. 
    Используя функцию обхода в разработанной программе произвести чтение структуры бинарного дерева и выполнить его обход, сохранив последовательность прохождения вершин в текстовом файле (.txt).
    Операции по работе с деревом: 
        Добавить элемент
        Поиск элемента
        Обход дерева
*/

int main() {
    std::cout << "Hello World!";
    return 0;
}